#
# .zsh_plugins.txt - antidote plugins file
#

#
# Init
#

mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/homebrew conditional:is-macos
#$ZDOTDIR/plugins/xdg

#
# Completions
#

mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

#
# Editor
#

mattmc3/zephyr path:plugins/editor
jeffreytse/zsh-vi-mode
# sorin-ionescu/prezto path:modules/editor
# romkatv/zsh-no-ps2
$ZDOTDIR/lib/zsh-no-ps2.zsh
wazum/zsh-directory-dot-expansion

#
# Prompts
#

# sindresorhus/pure kind:fpath
# romkatv/powerlevel10k kind:fpath
# miekg/lean kind:fpath
mattmc3/zephyr path:plugins/prompt

#
# Clipboard
#

ohmyzsh/ohmyzsh path:lib/clipboard.zsh
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/copybuffer
ohmyzsh/ohmyzsh path:plugins/copyfile

#
# Misc
#

mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/utility
#mattmc3/zephyr path:plugins/zfunctions
$ZDOTDIR/plugins/git
$ZDOTDIR/plugins/abbreviations
$ZDOTDIR/plugins/fzf
matthieusb/zsh-sdkman

#
# OMZ
#

ohmyzsh/ohmyzsh path:plugins/direnv
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/kubectl
#ohmyzsh/ohmyzsh path:plugins/skaffold

#
# Utils
#

romkatv/zsh-bench kind:path
# aloxaf/fzf-tab
mattmc3/zman

#
# macOS
#

mattmc3/zephyr path:plugins/macos conditional:is-macos

#
# Final
#

zdharma-continuum/fast-syntax-highlighting kind:defer
#zsh-users/zsh-syntax-highlighting
zsh-users/zsh-autosuggestions
# zsh-users/zsh-history-substring-search
zdharma-continuum/history-search-multi-word kind:defer

# vi: ft=properties
